# Java

: 썬 마이크로시스템즈(Sun Microsystems)에서 개발한 객체지향 프로그래밍 언어이다.

: 풍부한 클래스 라이브러리(Java API)를 통해 프로그래밍에 필요한 요소들을 기본적으로 제공하기 때문에 Java API만을 잘 활용하여도 강력한 기능의 자바 프로그래밍을 할 수 있다. 

: 스칼라 기반으로, 값 하나하나 의미가 있다. 



## Java의 특징 

1. 운영체제에 독립적이다.
   - 자바가상머신(JVM)이 자바 응용 프로그램으로부터 전달받은 명령을 해당 운영체제가 이해할 수 있도록 변환하여 전달한다. 
   - JVM은 운영체제에 종속적이지만, 여러 운영체제에 설치할 수 있는 서로 다른 버전의 JVM을 제공하고 있다. 
   - "Write once, run anywhere" (한번 작성하면, 어디서나 실행된다.)
2. 객체지향언어이다. 
   - object-oriented programming language
   - 상속, 캡슐화, 다형성이 가능하다. 
3. 간결하고 명료하여 배우기가 쉽다.
4. Garbage Collection (이하 gc)
   - 자동 메모리 관리 
   - 자바로 작성된 프로그램이 실행되면, gc가 자동적으로 메모리를 관리한다.
5. 네트워크와 분산처리를 지원한다.
   - Java API를 통해 네트워크 관련 프로그램을 쉽게 개발할 수 있다. 
6. 멀티쓰레드를 지원한다.
   - 시스템과 관계없이 구현가능하다. 
   - 관련 Java API가 제공되어 구현이 쉽다.
   - 쓰레드들의 스케쥴링은 자바 인터프리터가 담당한다. 
7. 동적 로딩을 지원한다. 
   - 실행 시에 모든 클래스가 로딩되지 않고, 필요한 시점에 클래스를 로딩하여 사용할 수 있다. 
   - 일부 클래스가 변경되어도 다시 컴파일하지 않아도 된다.



## JVM

: Java Virtual Machine

: 자바로 작성된 애플리케이션은 모두 JVM에서만 실행되므로 자바 애플리케이션을 실행하기 위해서는 반드시 JVM이 필요하다.

| 일반 애플리케이션 | Java 애플리케이션 |
| ----------------- | ----------------- |
|                   |                   |



## Variable 

### local variable

: main 함수 내의 변수로, 반드시 선언해야 사용 가능하다. 

### Memeber variable

: 클래스의 멤버 변수로, 자동으로 초기화 된다. 

### Class variable

: Class 이름으로 접근한다. (static으로 선언되어, 이미 메모리에 떠 있는 자원을 사용한다.)



## String 

: Semi-Type

```
String s1 = new String("Java");
String s2 = "Java";
```

- new String() 으로 객체를 생성할 경우, 생성한 횟수 만큼 heap 영역에 생성된다. 
- 직접 문자열을 선언하여 객체를 생성할 경우, 코드 영역표에 "s2"가 생성된다. 문자열이 같은 경우, 해당 주소가 계속 할당된다. 



- %.2d : 소수점 아래 2자리까지 표현

- %n : 줄 바꿈

- %14.10d : 전체 14자리 중 10자리 표현 

- 평균 구하기 

  ```
  int a,b,c;
  
  ( 변수 a,b,c 선언 후 값 할당 )
  
  float f = (a+b+c) / 3. 
  ```



### 객체 비교 

- 객체 비교 시, equals() 사용

```
String s1 = new String("hello");
String s2 = new String("hello");
```

- s1 == s2	--> False
  - s1 과 s2에 저장된 값은 같지만, 주소값은 다르다.

- s1.equals(s2)    --> True
  - euqals()는 객체 자체를 비교하므로, 결과는 true이다. 



```
s1 = "hello";
s2 = "hello";
```

- s1 == s2	, 	s1.equals(s2)	--> Ture
  - s1, s2 모두 코드표 영역에 같은 주소에 할당되어 같은 주소의 같은 값이 할당된다. 

### Garbage Collector

: 프로그램 실행에 필요한 메모리를 Garbage Collector (이하 GC)가 자동으로 관리한다. 

: 자바의 경우, 메모리 할당의 기능은 있어도 메모리 반환 기능은 없기 때문에, 사용하지 않는 메모리는 자바 가상 기계(JVM)에 자동으로 반환된다.  

1. 사용되지 않는 메모리, 유효하지 않은 메모리 주소는 free 시킨다. 
2. 성능 저하를 최소한으로 하며 수행한다. 



- Stack : 객체를 생성했을 때 객체가 저장되는 메모리의 주소를 저장한다.
- Heap : 메모리의 주소와 연결되어 실제 객체의 값을 저장한다.

** GC가 관리하는 영역 = heap 



- 예 1

```
String a = "Java";
String b = "Programming";

a = b;
```

1. 각각 String 객체 a와 b가 생성된다. 
2. a가 가진 주소값이 b의 주소값으로 대체된다. 
3. 기존의 a가 가졌던 주소값은 사용하지 않는 주소로, GC의 대상이 된다.



- 예 2

```
Date d = new Date();
```

1. Date 클래스가 heap영역으로 로딩된다. 

2. d.toLocal() --> 변수 d가 가진 Date 클래스의 toLocal의 메서드를 호출한다. 

3. Date d2 = d --> 새로운 변수 d2는 d와 같은 메모리 공간을 가리킨다. 

4. d = null --> 더 이상 사용하지 않을 경우, null 값으로 setting한다. 

   ​	a. GC의 제거 대상임을 알린다. 

   ​	b. 아직 주소를 지정하지 않은 상황이다. 

** 변수를 선언하지 않고 new Date()를 하는 경우, Date 클래스의 자원이 잠깐 필요할 때만 이용하여 접근한다. 이후, GC가 알아서 처리한다. 



#### 난수 

```
1~45 사이의 정수 
- (int)( 45 * Math.Random() + 1 )
```

